# Pandas Cheat Sheet

In [2]:
import pandas as pd

## Creating a 1D labelled array

In [3]:
s = pd.Series([3,-5,7,4], index=['a','b','c','d'])
print(s)

a    3
b   -5
c    7
d    4
dtype: int64

## Creating a 2D Table

In [7]:
data = {'Country': ['Belgium','India','Brazil'],
        'Capital': ['Brussels','New Delhi','Brasilia'],
        'Population': [111,130,207]}
#df = pd.DataFrame(data, columns=['Country','Capital','Population'])
df = pd.DataFrame(data)
print(df)

   Country    Capital  Population
0  Belgium   Brussels         111
1    India  New Delhi         130
2   Brazil   Brasilia         207

## Dropping

In [10]:
# Drop values from a series
print(s.drop(['a','c']))

# Drop a column from a DF
print(df.drop('Country', axis=1))

b   -5
d    4
dtype: int64
     Capital  Population
0   Brussels         111
1  New Delhi         130
2   Brasilia         207

## Help

In [11]:
help(pd.Series.loc)

Help on property:

    Access a group of rows and columns by label(s) or a boolean array.

    ``.loc[]`` is primarily label based, but may also be used with a
    boolean array.

    Allowed inputs are:

    - A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
      interpreted as a *label* of the index, and **never** as an
      integer position along the index).
    - A list or array of labels, e.g. ``['a', 'b', 'c']``.
    - A slice object with labels, e.g. ``'a':'f'``.

      .. warning:: Note that contrary to usual python slices, **both** the
          start and the stop are included

    - A boolean array of the same length as the axis being sliced,
      e.g. ``[True, False, True]``.
    - An alignable boolean Series. The index of the key will be aligned before
      masking.
    - An alignable Index. The Index of the returned selection will be the input.
    - A ``callable`` function with one argument (the calling Series or
      DataFrame) and that returns valid output for indexing (one of the above)

    See more at :ref:`Selection by Label <indexing.label>`.

    Raises
    ------
    KeyError
        If any items are not found.
    IndexingError
        If an indexed key is passed and its index is unalignable to the frame index.

    See Also
    --------
    DataFrame.at : Access a single value for a row/column label pair.
    DataFrame.iloc : Access group of rows and columns by integer position(s).
    DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
                   Series/DataFrame.
    Series.loc : Access group of values using labels.

    Examples
    --------
    **Getting values**

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...                   index=['cobra', 'viper', 'sidewinder'],
    ...                   columns=['max_speed', 'shield'])
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4       5
    sidewinder          7       8

    Single label. Note this returns the row as a Series.

    >>> df.loc['viper']
    max_speed    4
    shield       5
    Name: viper, dtype: int64

    List of labels. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[['viper', 'sidewinder']]
                max_speed  shield
    viper               4       5
    sidewinder          7       8

    Single label for row and column

    >>> df.loc['cobra', 'shield']
    2

    Slice with labels for row and single label for column. As mentioned
    above, note that both the start and stop of the slice are included.

    >>> df.loc['cobra':'viper', 'max_speed']
    cobra    1
    viper    4
    Name: max_speed, dtype: int64

    Boolean list with the same length as the row axis

    >>> df.loc[[False, False, True]]
                max_speed  shield
    sidewinder          7       8

    Alignable boolean Series:

    >>> df.loc[pd.Series([False, True, False],
    ...                  index=['viper', 'sidewinder', 'cobra'])]
                         max_speed  shield
    sidewinder          7       8

    Index (same behavior as ``df.reindex``)

    >>> df.loc[pd.Index(["cobra", "viper"], name="foo")]
           max_speed  shield
    foo
    cobra          1       2
    viper          4       5

    Conditional that returns a boolean Series

    >>> df.loc[df['shield'] > 6]
                max_speed  shield
    sidewinder          7       8

    Conditional that returns a boolean Series with column labels specified

    >>> df.loc[df['shield'] > 6, ['max_speed']]
                max_speed
    sidewinder          7

    Multiple conditional using ``&`` that returns a boolean Series

    >>> df.loc[(df['max_speed'] > 1) & (df['shield'] < 8)]
                max_speed  shield
    viper          4       5

    Multiple conditional using ``|`` that returns a boolean Series

    >>> df.loc[(df['max_speed'] > 4) | (df['shield'] < 5)]
                max_speed  shield
    cobra               1       2
    sidewinder          7       8

    Please ensure that each condition is wrapped in parentheses ``()``.
    See the :ref:`user guide<indexing.boolean>`
    for more details and explanations of Boolean indexing.

    .. note::
        If you find yourself using 3 or more conditionals in ``.loc[]``,
        consider using :ref:`advanced indexing<advanced.advanced_hierarchical>`.

        See below for using ``.loc[]`` on MultiIndex DataFrames.

    Callable that returns a boolean Series

    >>> df.loc[lambda df: df['shield'] == 8]
                max_speed  shield
    sidewinder          7       8

    **Setting values**

    Set value for all items matching the list of labels

    >>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4      50
    sidewinder          7      50

    Set value for an entire row

    >>> df.loc['cobra'] = 10
    >>> df
                max_speed  shield
    cobra              10      10
    viper               4      50
    sidewinder          7      50

    Set value for an entire column

    >>> df.loc[:, 'max_speed'] = 30
    >>> df
                max_speed  shield
    cobra              30      10
    viper              30      50
    sidewinder         30      50

    Set value for rows matching callable condition

    >>> df.loc[df['shield'] > 35] = 0
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       0
    sidewinder          0       0

    Add value matching location

    >>> df.loc["viper", "shield"] += 5
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       5
    sidewinder          0       0

    Setting using a ``Series`` or a ``DataFrame`` sets the values matching the
    index labels, not the index positions.

    >>> shuffled_df = df.loc[["viper", "cobra", "sidewinder"]]
    >>> df.loc[:] += shuffled_df
    >>> df
                max_speed  shield
    cobra              60      20
    viper               0      10
    sidewinder          0       0

    **Getting values on a DataFrame with an index that has integer labels**

    Another example using integers for the index

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...                   index=[7, 8, 9], columns=['max_speed', 'shield'])
    >>> df
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    Slice with integer labels for rows. As mentioned above, note that both
    the start and stop of the slice are included.

    >>> df.loc[7:9]
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    **Getting values with a MultiIndex**

    A number of examples using a DataFrame with a MultiIndex

    >>> tuples = [
    ...     ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ...     ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ...     ('viper', 'mark ii'), ('viper', 'mark iii')
    ... ]
    >>> index = pd.MultiIndex.from_tuples(tuples)
    >>> values = [[12, 2], [0, 4], [10, 20],
    ...           [1, 4], [7, 1], [16, 36]]
    >>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
    >>> df
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Single label. Note this returns a DataFrame with a single index.

    >>> df.loc['cobra']
             max_speed  shield
    mark i          12       2
    mark ii          0       4

    Single index tuple. Note this returns a Series.

    >>> df.loc[('cobra', 'mark ii')]
    max_speed    0
    shield       4
    Name: (cobra, mark ii), dtype: int64

    Single label for row and column. Similar to passing in a tuple, this
    returns a Series.

    >>> df.loc['cobra', 'mark i']
    max_speed    12
    shield        2
    Name: (cobra, mark i), dtype: int64

    Single tuple. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[[('cobra', 'mark ii')]]
                   max_speed  shield
    cobra mark ii          0       4

    Single tuple for the index with a single label for the column

    >>> df.loc[('cobra', 'mark i'), 'shield']
    2

    Slice from index tuple to single label

    >>> df.loc[('cobra', 'mark i'):'viper']
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Slice from index tuple to index tuple

    >>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
                        max_speed  shield
    cobra      mark i          12       2
               mark ii          0       4
    sidewinder mark i          10      20
               mark ii          1       4
    viper      mark ii          7       1

    Please see the :ref:`user guide<advanced.advanced_hierarchical>`
    for more details and explanations of advanced indexing.

## Sort and Rank

In [13]:
df.sort_index()

   Country    Capital  Population
0  Belgium   Brussels         111
1    India  New Delhi         130
2   Brazil   Brasilia         207

In [14]:
df.sort_values(by='Country')

   Country    Capital  Population
0  Belgium   Brussels         111
2   Brazil   Brasilia         207
1    India  New Delhi         130

In [15]:
df.rank()

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         2.0
2      2.0      1.0         3.0

## I/O

### Read/ Write to CSV

In [20]:
df.to_csv('data/myDataFrame.csv')

new_df = pd.read_csv('data/myDataFrame.csv',header=None,nrows=2)

In [21]:
new_df

     0        1         2           3
0  NaN  Country   Capital  Population
1  0.0  Belgium  Brussels         111

### Read/Write to Excel

In [31]:
df.to_excel('data/myDF.xlsx', sheet_name='Sheet1')
new_xl = pd.read_excel('data/myDF.xlsx','Sheet1',header=None,nrows=3)

In [32]:
new_xl

     0        1          2           3
0  NaN  Country    Capital  Population
1  0.0  Belgium   Brussels         111
2  1.0    India  New Delhi         130

### Read and Write to SQL Query/ DB Table

In [33]:
'''
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')
pd.read_sql("SELECT * FROM my_table;",engine)
pd.read_sql_table('my_table',engine)
pd.read_sql_query("SELECT * FROM my_table;",engine)

df.to_sql('myDF', engine)
'''

'\nfrom sqlalchemy import create_engine\nengine = create_engine(\'sqlite:///:memory:\')\npd.read_sql("SELECT * FROM my_table;",engine)\npd.read_sql_table(\'my_table\',engine)\npd.read_sql_query("SELECT * FROM my_table;",engine)\n\ndf.to_sql(\'myDF\', engine)\n'

## Selection

### Getting

In [34]:
print(s['b'])

print(df[1:])

-5
  Country    Capital  Population
1   India  New Delhi         130
2  Brazil   Brasilia         207

### Setting

In [49]:
s['e'] = 6

In [50]:
s

a    3
b   -5
c    7
d    4
e    6
dtype: int64

### Selecting by Position or Label

In [35]:
df

   Country    Capital  Population
0  Belgium   Brussels         111
1    India  New Delhi         130
2   Brazil   Brasilia         207

In [36]:
df.iloc[[0],[0]]

   Country
0  Belgium

In [42]:
df.loc[[1],['Capital']]

     Capital
1  New Delhi

### Boolean Indexing

In [45]:
s[~(s>1)]

b   -5
dtype: int64

In [47]:
s[(s<-1) | (s>3)]

b   -5
c    7
d    4
dtype: int64

In [48]:
df[df['Population']>120]

  Country    Capital  Population
1   India  New Delhi         130
2  Brazil   Brasilia         207

## Retrieving DF Information

### Basic Information

In [51]:
df.shape

(3, 3)

In [52]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [53]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [56]:
df.count()

Country       3
Capital       3
Population    3
dtype: int64

### Summary

In [57]:
df.sum()

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasilia
Population                          448
dtype: object

In [58]:
df.cumsum()

              Country                    Capital  Population
0             Belgium                   Brussels         111
1        BelgiumIndia          BrusselsNew Delhi         241
2  BelgiumIndiaBrazil  BrusselsNew DelhiBrasilia         448

In [59]:
df.min()

Country        Belgium
Capital       Brasilia
Population         111
dtype: object

In [60]:
df.max()

Country           India
Capital       New Delhi
Population          207
dtype: object

In [61]:
df.idxmin()

Country       0
Capital       2
Population    0
dtype: int64

In [62]:
df.idxmax()

Country       1
Capital       1
Population    2
dtype: int64

In [63]:
df.describe()

       Population
count    3.000000
mean   149.333333
std     50.836339
min    111.000000
25%    120.500000
50%    130.000000
75%    168.500000
max    207.000000

In [66]:
df['Population'].mean()

np.float64(149.33333333333334)

In [67]:
df['Population'].median()

np.float64(130.0)

### Applying Functions

In [68]:
f = lambda x:x*2
df.apply(f)

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels         222
1      IndiaIndia  New DelhiNew Delhi         260
2    BrazilBrazil    BrasiliaBrasilia         414

In [70]:
df.map(f)

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels         222
1      IndiaIndia  New DelhiNew Delhi         260
2    BrazilBrazil    BrasiliaBrasilia         414

## Data Alignment

### Internal Data Alignment

In [71]:
s3 = pd.Series([7,-2,3],index=['a','c','d'])

In [72]:
s

a    3
b   -5
c    7
d    4
e    6
dtype: int64

In [73]:
s3

a    7
c   -2
d    3
dtype: int64

In [74]:
s+s3

a    10.0
b     NaN
c     5.0
d     7.0
e     NaN
dtype: float64

### Arithmetic Operations wth Fill Methods

In [76]:
s.add(s3, fill_value=0)

a    10.0
b    -5.0
c     5.0
d     7.0
e     6.0
dtype: float64

In [77]:
s.sub(s3, fill_value=2)

a   -4.0
b   -7.0
c    9.0
d    1.0
e    4.0
dtype: float64

In [78]:
s.div(s3,fill_value=4)

a    0.428571
b   -1.250000
c   -3.500000
d    1.333333
e    1.500000
dtype: float64

In [79]:
s.mul(s3,fill_value=3)

a    21.0
b   -15.0
c   -14.0
d    12.0
e    18.0
dtype: float64